{
  "backend/main.mo": "Motoko canister storing wall-of-fame entries with add, list, count, and ID generation functions.",
  "feature_evidence.json": "Feature evidence report listing implemented frontend features, affected files, components, and test references.",
  "frontend-file-summaries.txt": "Pre-written summaries describing behavior and purpose of various frontend files across the app.",
  "frontend/index.css": "Tailwind base styles and theme variables defining light/dark color tokens and global background/foreground behavior.",
  "frontend/index.html": "Static HTML entry point setting charset, viewport, document title, and React root mount.",
  "frontend/src/App.tsx": "Top-level component controlling navigation between intro, game, outro, and hall-of-fame phases.",
  "frontend/src/components/WallOfFameLink.tsx": "Floating button component that triggers navigation to the Wall of Fame view.",
  "frontend/src/content/story.ts": "Defines narrative story steps, text blocks, slider question, and Barnabus story content for the intro flow.",
  "frontend/src/features/game/CollectiblesHud.tsx": "HUD displaying collected star count using an amber-styled badge with icon.",
  "frontend/src/features/game/GameView.tsx": "Main game logic component handling movement, collectibles, dialogs, audio, environment checks, and transitions.",
  "frontend/src/features/game/GoalsModal.tsx": "Modal describing Barnabus’s goals with Escape key dismissal and a continue button.",
  "frontend/src/features/game/jokes.ts": "Exports a list of short goal-themed joke strings.",
  "frontend/src/features/game/MobilePhoneModal.tsx": "Empty placeholder file with no implemented content.",
  "frontend/src/features/game/passability.ts": "Provides utilities to compute corridor passable channels and detect obstacle intersections for path validation.",
  "frontend/src/features/game/SpeechBalloon.tsx": "Speech balloon component that positions and clamps a text bubble with a tail above the character.",
  "frontend/src/features/game/StarPickupModal.tsx": "Displays a modal for star pickups with optional completion message and Escape-key dismissal.",
  "frontend/src/features/game/useGameLoop.ts": "Implements a requestAnimationFrame game loop hook that invokes an update callback with delta time.",
  "frontend/src/features/game/useGameplayAudio.ts": "Manages background music and star pickup sounds, handling pauses and timed resumes.",
  "frontend/src/features/game/useKeyboardControls.ts": "Tracks arrow-key movement and space/joke actions with disable support and event listeners.",
  "frontend/src/features/game/worldMap.ts": "Generates a random corridor path, defines map entities, and provides utilities for corridor checks and obstacles.",
  "frontend/src/features/hall-of-fame/certificatePdf.ts": "Generates a certificate PDF by loading a template, drawing a centered name onto it, and triggering a download using pdf-lib from CDN.",
  "frontend/src/features/hall-of-fame/HallOfFameView.tsx": "Renders the Wall of Fame view, fetching entries, handling errors, and allowing certificate download.",
  "frontend/src/features/hall-of-fame/sanitizeCertificateFilename.ts": "Converts a name into a safe filename by replacing non-alphanumeric characters with underscores and trimming extras.",
  "frontend/src/features/intro/GoalStickinessQuestion.tsx": "Renders a slider-based question, provides feedback on submission, and reveals a continue button after a delay.",
  "frontend/src/features/intro/introBackground.ts": "Computes dynamic intro gradients based on darkening steps and exports initial, final, and constants for transitions.",
  "frontend/src/features/intro/IntroFlow.tsx": "Controls the multi-stage intro narrative, revealing text over time and managing gradient transitions and flow progression.",
  "frontend/src/features/outro/NameSubmissionModal.tsx": "Modal for entering and submitting a player's name with validation, error display, and controlled closing behavior.",
  "frontend/src/features/outro/OutroFlow.tsx": "Manages the outro narrative flow, revealing text blocks, takeaways, and eventually triggering the name submission modal.",
  "frontend/src/features/outro/TakeawayModal.tsx": "React modal that displays a takeaway’s title, body, and optional link, with escape handling and styled UI.",
  "frontend/src/features/outro/takeawaysContent.ts": "Exports structured takeaway items with titles, bodies, and optional links used by the modal and PDF.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to Internet Identity, refetching dependent queries when the identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides context and hooks for Internet Identity login, identity persistence, and status tracking.",
  "frontend/src/hooks/usePersistentPlayerId.ts": "Manages player ID and completion state in localStorage with setters and reset helpers.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for fetching and mutating Wall of Fame entries using the backend actor.",
  "frontend/src/index.css": "Tailwind setup with theme variables, dark mode values, and custom utilities like animations and modal fade-in.",
  "frontend/src/main.tsx": "Initializes the app, wrapping it with QueryClientProvider and InternetIdentityProvider before rendering.",
  "frontend/tailwind.config.js": "Tailwind configuration enabling dark mode, content scanning, custom OKLCH color system, extended theming, animations, and typography/container/animate plugins.",
  "project_state.json": "JSON snapshot of the project's current feature set, including versioning, overall app summary, and a detailed list of implemented features with metadata."
}