{
  "backend/main.mo": "Defines an empty Motoko actor, serving as a placeholder backend with no logic implemented.",
  "feature_evidence.json": "Feature evidence report documenting four outro-related frontend features, their affected files, component dependencies, test requirements, and confidence levels.",
  "frontend-file-summaries.txt": "Prewritten high-level summaries of key frontend source files, describing application flow, game mechanics, intro/outro behavior, and styling infrastructure.",
  "frontend/index.css": "Global Tailwind CSS setup defining design tokens, light/dark theme variables, chart colors, and base element styling.",
  "frontend/index.html": "HTML entry point that mounts the React app and loads the Vite-powered main TypeScript bundle.",
  "frontend/src/App.tsx": "Root React component managing a three-phase state machine (intro, game, outro) and switching views based on completion callbacks.",
  "frontend/src/content/story.ts": "Centralized story configuration defining intro narrative steps, goal blocks, slider question, statistics, and Donald’s two-part narrative for staged reveal.",
  "frontend/src/features/game/CollectiblesHud.tsx": "HUD component displaying the number of collected stars out of the total using a styled star icon and counter.",
  "frontend/src/features/game/GameView.tsx": "Main game component implementing a top-down collectible game with movement, camera tracking, collisions, modals, jokes, collectibles logic, and outro trigger on final star dismissal.",
  "frontend/src/features/game/GoalsModal.tsx": "Modal dialog introducing Donald’s goals and game objective, dismissible via a Continue button or Escape key.",
  "frontend/src/features/game/jokes.ts": "Exports a static array of lighthearted goal-related joke strings used elsewhere in the game.",
  "frontend/src/features/game/MobilePhoneModal.tsx": "Empty file reserved for a future modal component related to the mobile phone collectible.",
  "frontend/src/features/game/passability.ts": "Utility module defining corridor passability rules, guaranteed traversal channel geometry, and collision checks to ensure obstacles never block the playable path.",
  "frontend/src/features/game/SpeechBalloon.tsx": "UI component that renders an animated speech balloon positioned above the character while staying within canvas bounds.",
  "frontend/src/features/game/StarPickupModal.tsx": "React modal component shown when picking up a star, with title/description, optional completion message, Escape key handling, and a Continue button to dismiss.",
  "frontend/src/features/game/useGameLoop.ts": "Custom React hook that runs a requestAnimationFrame game loop and calls an onUpdate callback with delta time each frame.",
  "frontend/src/features/game/useKeyboardControls.ts": "Custom hook that tracks arrow-key movement state and handles Space and J key actions, with support for disabling input.",
  "frontend/src/features/game/worldMap.ts": "Defines world map types and generates a randomized, guaranteed-passable corridor path with collision helpers and corridor boundary checks.",
  "frontend/src/features/intro/GoalStickinessQuestion.tsx": "Intro UI component presenting a slider-based question with feedback, delayed Continue button, and submission handling.",
  "frontend/src/features/intro/introBackground.ts": "Provides functions to compute dynamic background gradients that darken progressively during the intro and a final terminal gradient.",
  "frontend/src/features/intro/IntroFlow.tsx": "Manages the multi-stage introductory narrative flow, timed text reveals, background gradient transitions, and progression to game start.",
  "frontend/src/features/outro/OutroFlow.tsx": "Implements a multi-stage outro narrative with timed text reveals, continue buttons, and a final takeaway selection flow, coordinating UI state across several outro text blocks.",
  "frontend/src/features/outro/TakeawayModal.tsx": "Defines a modal dialog for displaying an individual takeaway, with overlay, escape-key handling, close actions, and placeholder informational content.",
  "frontend/src/hooks/useActor.ts": "Provides a React Query hook that creates and caches a backend actor based on the current Internet Identity, recreating and invalidating dependent queries when identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements an authentication context and provider for DFINITY Internet Identity, handling login, logout, persisted identities, and exposing detailed login status flags.",
  "frontend/src/index.css": "Sets up Tailwind base styles, CSS variables for light and dark themes, global typography, and custom utility classes like animations and pixelated rendering.",
  "frontend/src/main.tsx": "Bootstraps the React application by rendering the App component wrapped with React Query and Internet Identity providers and importing global styles.",
  "frontend/tailwind.config.js": "Configures Tailwind CSS with dark mode, content paths, design tokens mapped to CSS variables, custom animations, and additional plugins.",
  "project_state.json": "Project metadata describing a React + TypeScript SPA with a staged, story-driven intro that transitions into a linear top-down canvas game, then back into an outro narrative. It documents existing features, including the intro state machine, timed narrative reveals, mood-darkening gradients, gameplay mechanics, collectibles flow, and scaffolding for ICP authentication and build tooling."
}