{
  "backend/main.mo": "Motoko canister storing Wall of Fame entries with add, count, list, and ID-generation functions.",
  "feature_evidence.json": "Feature evidence report listing implemented features, affected files, components, test IDs, and confidence levels.",
  "frontend-file-summaries.txt": "Collection of prewritten summaries describing the purpose and recent changes of numerous frontend files.",
  "frontend/index.css": "Tailwind base and theme variable definitions for light/dark modes using custom OKLCH color tokens.",
  "frontend/index.html": "Basic HTML shell loading the React app via main.tsx.",
  "frontend/src/App.tsx": "Top-level component controlling the intro, game, outro, and hall-of-fame phase transitions.",
  "frontend/src/components/WallOfFameLink.tsx": "Small button component fixed in the corner that triggers navigation to the Wall of Fame.",
  "frontend/src/content/story.ts": "Defines structured story steps, text blocks, and narrative content for the intro flow.",
  "frontend/src/features/game/CollectiblesHud.tsx": "HUD component showing collected vs total stars using an icon and styled counter.",
  "frontend/src/features/game/GameView.tsx": "Main game component managing canvas rendering, movement, collisions, collectibles, modals, audio, and transitions.",
  "frontend/src/features/game/GoalsModal.tsx": "Modal explaining Barnabus's goals with Escape‑to‑dismiss and a continue button.",
  "frontend/src/features/game/jokes.ts": "Exports a small list of goal-themed joke strings.",
  "frontend/src/features/game/MobilePhoneModal.tsx": "Empty placeholder file with no implemented content.",
  "frontend/src/features/game/passability.ts": "Provides utilities to compute corridor channel AABBs and detect obstacle intersections for guaranteed passability.",
  "frontend/src/features/game/SpeechBalloon.tsx": "Renders a clamped speech balloon with a dynamically positioned tail based on canvas bounds.",
  "frontend/src/features/game/StarPickupModal.tsx": "Displays a modal for star pickups with optional completion message and Escape-to-dismiss behavior.",
  "frontend/src/features/game/useGameLoop.ts": "Implements a requestAnimationFrame game loop hook that reports delta time to an update callback.",
  "frontend/src/features/game/useGameplayAudio.ts": "Manages background music and star-collection audio, pausing and resuming music with deterministic timing.",
  "frontend/src/features/game/useKeyboardControls.ts": "Tracks arrow-key movement and handles space/J actions with disable support and event cleanup.",
  "frontend/src/features/game/worldMap.ts": "Generates a random corridor path, exposes corridor checks, and defines world obstacle/map structures.",
  "frontend/src/features/hall-of-fame/certificatePdf.ts": "Loads pdf-lib from CDN and generates a certificate PDF with the user’s name and a styled Key Takeaways page.",
  "frontend/src/features/hall-of-fame/HallOfFameView.tsx": "Fetches and displays Wall of Fame entries with certificate download, refresh, and optional back-navigation.",
  "frontend/src/features/hall-of-fame/sanitizeCertificateFilename.ts": "Converts a name into a safe, ASCII filename by replacing invalid characters and trimming underscores.",
  "frontend/src/features/intro/GoalStickinessQuestion.tsx": "Renders an interactive slider question with feedback and delayed continue flow.",
  "frontend/src/features/intro/introBackground.ts": "Generates dynamic gradient backgrounds that darken over steps and exposes constants for intro progression.",
  "frontend/src/features/intro/IntroFlow.tsx": "Manages the multi-stage intro story flow with timed text reveals, gradient transitions, and navigation to the next steps.",
  "frontend/src/features/outro/NameSubmissionModal.tsx": "Displays a modal for entering and submitting a player name with validation, errors, and skip options.",
  "frontend/src/features/outro/OutroFlow.tsx": "Controls the outro narrative flow, revealing text blocks, takeaways, and triggering name submission and completion logic.",
  "frontend/src/features/outro/TakeawayModal.tsx": "React modal component that displays a takeaway by title, handles closing via button, overlay, or Escape key, and fetches content from TAKEAWAYS.",
  "frontend/src/features/outro/takeawaysContent.ts": "Defines the structure and list of takeaway items with titles, bodies, and optional links used throughout the app.",
  "frontend/src/hooks/useActor.ts": "Creates and caches a backend actor based on the user’s identity and invalidates dependent queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity auth state, login/logout handling, and persisted identity loading via a React context provider.",
  "frontend/src/hooks/usePersistentPlayerId.ts": "Manages a persistent player ID and completion flag using localStorage with helpers to set, clear, and update values.",
  "frontend/src/hooks/useQueries.ts": "Defines react‑query hooks for fetching and adding Wall of Fame entries using the backend actor with auto‑refetch behavior.",
  "frontend/src/index.css": "Tailwind base styles and custom CSS variables, themes, animations, and utility classes for the app’s design.",
  "frontend/src/main.tsx": "Bootstraps the React app, providing react‑query and Internet Identity context providers.",
  "frontend/tailwind.config.js": "Tailwind configuration extending colors, typography, animations, and container settings with plugin integration.",
  "project_state.json": "Tracks the project’s current state, version, and a detailed list of implemented intro flow, narrative, UI, and progression features. Contains metadata for gating logic, timed reveals, content modeling, and completed finale and Hall of Fame flow."
}