{
  "backend/main.mo": "Defines an empty Internet Computer actor with no methods or state.",
  "feature_evidence.json": "Feature evidence report documenting two implemented gameplay/UI changes, listing affected files, components, test IDs, and confidence levels.",
  "frontend-file-summaries.txt": "Prewritten high-level summaries of frontend source files, used as reference documentation for build and feature planning.",
  "frontend/index.css": "Global Tailwind CSS setup defining design tokens, light/dark theme variables, and base styles for the frontend.",
  "frontend/index.html": "HTML entry point that mounts the React app and loads the main TypeScript module.",
  "frontend/src/App.tsx": "Root React component that switches between the intro narrative flow and the game view based on local state.",
  "frontend/src/content/story.ts": "Structured story data defining the intro narrative steps, goal blocks, slider question, statistics, and Donald storyline content.",
  "frontend/src/features/game/CollectiblesHud.tsx": "UI overlay component that displays collected versus total star collectibles in the game.",
  "frontend/src/features/game/GameView.tsx": "Core game component implementing canvas-based top-down gameplay, movement, camera follow, collectibles, jokes, audio, and modal triggers.",
  "frontend/src/features/game/GoalsModal.tsx": "Modal dialog shown after first movement that explains Donald’s goals and can be dismissed via button or Escape key.",
  "frontend/src/features/game/jokes.ts": "Exports a fixed list of five joke strings randomly used during gameplay actions.",
  "frontend/src/features/game/passability.ts": "Defines collision-safe corridor channel geometry and utilities to ensure generated corridors remain traversable, including AABB channel calculations for segments, junctions, and obstacle intersection checks.",
  "frontend/src/features/game/SpeechBalloon.tsx": "Renders a positioned speech balloon above the character to display joke text within canvas bounds.",
  "frontend/src/features/game/useGameLoop.ts": "Provides a React hook that runs a requestAnimationFrame-based game loop and invokes an update callback with delta time each frame.",
  "frontend/src/features/game/useKeyboardControls.ts": "Implements a React hook for keyboard input, tracking arrow-key movement state and triggering callbacks on spacebar and 'J' key presses.",
  "frontend/src/features/game/worldMap.ts": "Generates a path-first corridor-based world map with obstacles and collectibles, ensuring passable paths using corridor segments and validation helpers.",
  "frontend/src/features/intro/GoalStickinessQuestion.tsx": "Renders an intro slider question with delayed feedback and a continue button, managing submission state and user interaction timing.",
  "frontend/src/features/intro/introBackground.ts": "Generates dynamic CSS background gradients that progressively darken based on intro progression, plus a final terminal gradient.",
  "frontend/src/features/intro/IntroFlow.tsx": "Controls the multi-stage introductory narrative flow, handling timed text reveals, background gradient transitions, and progression through story steps.",
  "frontend/src/hooks/useActor.ts": "Defines a React Query hook that creates and caches an authenticated or anonymous backend actor based on identity, and invalidates dependent queries when it changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Defines a React context, provider, and hook for Internet Identity authentication using DFINITY AuthClient, managing identity state, login/logout actions, and detailed login status flags. It loads configuration, creates the auth client with custom idle/login options, and exposes identity lifecycle to the app.",
  "frontend/src/index.css": "Global Tailwind CSS entry defining base, component, and utility layers with extensive CSS variables for light/dark themes using OKLCH colors. It also sets default typography, background styles, and custom utilities like bounce animation and pixelated rendering.",
  "frontend/src/main.tsx": "Application entry point that creates the React root and renders the App wrapped with React Query and InternetIdentity providers. It initializes the QueryClient and imports global styles.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration enabling class-based dark mode, scanning frontend sources, and extending the theme with OKLCH-based color tokens, layout settings, animations, and fonts. It registers typography, container query, and animation plugins.",
  "project_state.json": "Machine-readable snapshot describing the overall project architecture, narrative-driven intro flow, 2D canvas game mechanics, and supporting infrastructure like Internet Identity and build templates. It enumerates existing features with IDs, descriptions, and versioning for planning and tracking."
}