{
  "backend/main.mo": "Defines an empty Motoko actor as a placeholder backend entry point with no functionality implemented.",
  "feature_evidence.json": "Structured report mapping implemented features to files, components, tests, and confidence levels for the intro narrative and interactions.",
  "frontend-file-summaries.txt": "Reference document listing concise human-written summaries of all frontend source files and their responsibilities.",
  "frontend/index.css": "Global Tailwind CSS setup defining OKLCH-based color tokens, light/dark themes, and base styles for the application.",
  "frontend/index.html": "HTML entry point that mounts the React app and loads the main TypeScript module.",
  "frontend/src/App.tsx": "Root React component that switches between the intro narrative flow and the game view based on application state.",
  "frontend/src/content/story.ts": "Defines typed story step data and exports the full intro narrative text and structure, including post-slider steps.",
  "frontend/src/features/game/GameView.tsx": "Canvas-based 2D game view rendering a scrolling terrain, controllable character, and timed joke speech balloons.",
  "frontend/src/features/game/jokes.ts": "Exports a fixed array of five goal-themed jokes used during gameplay.",
  "frontend/src/features/game/SpeechBalloon.tsx": "UI component that renders an animated speech balloon positioned above the character while staying within canvas bounds.",
  "frontend/src/features/game/useGameLoop.ts": "Custom React hook that drives a continuous animation loop and updates vertical scroll offset using requestAnimationFrame.",
  "frontend/src/features/game/useKeyboardControls.ts": "Custom React hook that tracks arrow-key movement state and triggers a callback when the spacebar is pressed.",
  "frontend/src/features/intro/GoalStickinessQuestion.tsx": "Interactive slider component that collects a 1–100% guess, shows conditional feedback, and advances the story after submission.",
  "frontend/src/features/intro/introBackground.ts": "Utility that computes a CSS linear-gradient background which progressively darkens and shifts hues based on the number of story steps marked as darkening.",
  "frontend/src/features/intro/IntroFlow.tsx": "React component that drives the intro narrative flow, sequencing text, a start button, and a slider interaction with timed transitions, background gradient changes, and a completion callback.",
  "frontend/src/hooks/useActor.ts": "Custom hook that creates and caches a backend actor via React Query, switching between anonymous and authenticated actors and invalidating dependent queries when the identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Context, provider, and hook for managing Internet Identity authentication, including login/logout, identity persistence, and detailed login status state.",
  "frontend/src/index.css": "Global Tailwind CSS setup defining design tokens (OKLCH color variables), light/dark themes, base styles, and a custom bounce animation utility.",
  "frontend/src/main.tsx": "Application entry point that renders the React app and wraps it with React Query and Internet Identity providers, and imports global styles.",
  "frontend/tailwind.config.js": "Tailwind configuration enabling dark mode, scanning sources, extending the theme with OKLCH-based colors, typography, animations, and custom layout utilities.",
  "project_state.json": "Project metadata describing the app’s narrative-driven goal-setting concept, implemented features, and current state/version of requirements."
}