{
  "backend/main.mo": "Motoko canister storing Wall of Fame entries with add, list, and auto-increment ID generation.",
  "feature_evidence.json": "Feature evidence report mapping features to affected frontend files, components, and test IDs.",
  "frontend-file-summaries.txt": "Prewritten summaries describing key functionality of various frontend files.",
  "frontend/index.css": "Root Tailwind CSS variables and dark theme tokens plus global background/foreground styling.",
  "frontend/index.html": "Basic HTML entry point loading the React app from main.tsx.",
  "frontend/src/App.tsx": "Top-level phase controller switching between intro, game, outro, and hall-of-fame views.",
  "frontend/src/components/WallOfFameLink.tsx": "Floating button component linking to the Wall of Fame screen.",
  "frontend/src/content/story.ts": "Structured story steps defining intro narrative, Barnabus sequence, slider question, and pre‑game text.",
  "frontend/src/features/game/CollectiblesHud.tsx": "HUD showing collected vs total star count using an amber star icon.",
  "frontend/src/features/game/GameView.tsx": "Main game component handling canvas rendering, movement, collectibles, modals, audio, and camera logic.",
  "frontend/src/features/game/GoalsModal.tsx": "Modal explaining Barnabus’s goals and dismissible via Escape or a Continue button.",
  "frontend/src/features/game/jokes.ts": "Exports a list of short goal-themed joke strings.",
  "frontend/src/features/game/MobilePhoneModal.tsx": "Empty placeholder file for a mobile phone modal.",
  "frontend/src/features/game/passability.ts": "Utilities for computing guaranteed traversable channels in corridor segments and detecting obstacle intersections.",
  "frontend/src/features/game/SpeechBalloon.tsx": "Renders a clamped speech balloon above the character with tail alignment and fade-in animation.",
  "frontend/src/features/game/StarPickupModal.tsx": "A modal component showing star pickup info with optional completion message and escape-to-dismiss behavior.",
  "frontend/src/features/game/useGameLoop.ts": "React hook implementing a requestAnimationFrame game loop that calls an onUpdate callback with delta time.",
  "frontend/src/features/game/useGameplayAudio.ts": "Hook managing background music and a star-collection sound with timed music pausing and resuming.",
  "frontend/src/features/game/useKeyboardControls.ts": "Hook handling arrow-key movement, space actions, and joke triggers with disable support.",
  "frontend/src/features/game/worldMap.ts": "Generates a randomized corridor-style world map with segments, corridor checks, and obstacle utilities.",
  "frontend/src/features/hall-of-fame/certificatePdf.ts": "Creates and downloads a minimal PDF certificate using basic text rendering and a sanitized filename.",
  "frontend/src/features/hall-of-fame/HallOfFameView.tsx": "Displays the Wall of Fame entries, highlights the current player, and provides certificate download functionality.",
  "frontend/src/features/hall-of-fame/sanitizeCertificateFilename.ts": "Transforms a name into a safe filename by replacing invalid characters with underscores and enforcing defaults.",
  "frontend/src/features/intro/GoalStickinessQuestion.tsx": "Renders a slider-based question with feedback and a delayed continue button in the intro flow.",
  "frontend/src/features/intro/introBackground.ts": "Generates animated intro gradients based on darkening steps and provides final gradient constants.",
  "frontend/src/features/intro/IntroFlow.tsx": "Manages the multi-stage intro sequence with timed text reveals, gradient transitions, and navigation to later steps.",
  "frontend/src/features/outro/NameSubmissionModal.tsx": "Modal for entering and submitting a player's name with validation, errors, and skip handling.",
  "frontend/src/features/outro/OutroFlow.tsx": "Controls the outro sequence with timed text blocks, takeaway selection, gradient lightening, and name submission flow.",
  "frontend/src/features/outro/TakeawayModal.tsx": "Modal component that displays takeaway content based on a title and handles close events, including Escape key support.",
  "frontend/src/hooks/useActor.ts": "Hook that creates and manages a backend actor tied to the user’s identity and refreshes dependent queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Context and provider for managing Internet Identity login, stored identities, and auth-client configuration.",
  "frontend/src/hooks/usePersistentPlayerId.ts": "Hook that persists a bigint player ID to localStorage and provides helpers to set or clear it.",
  "frontend/src/hooks/useQueries.ts": "React Query hooks for fetching and adding Wall of Fame entries through the backend actor.",
  "frontend/src/index.css": "Tailwind base styles plus custom CSS variables, animations, and utility classes for theming.",
  "frontend/src/main.tsx": "App entry point that sets up React Query and Internet Identity providers before rendering the app.",
  "frontend/tailwind.config.js": "Tailwind configuration enabling custom colors, typography, animations, and container queries.",
  "project_state.json": "Tracks project state version and summarizes completed intro-to-game flow work, plus lists detailed existing features for narrative sequencing, gating, animations, background transitions, and interactive steps."
}