{
  "backend/main.mo": "Defines an empty Motoko actor with no state or methods, serving as a placeholder backend entry point.",
  "feature_evidence.json": "Machine-readable report listing implemented gameplay features, affected frontend files, dependencies, test requirements, and confidence levels.",
  "frontend-file-summaries.txt": "Prewritten high-level summaries of key frontend source files to aid planning and context without opening each file.",
  "frontend/index.css": "Global Tailwind CSS setup defining base layers, design tokens, light/dark theme variables, and default background/text styling.",
  "frontend/index.html": "HTML entry point that mounts the React app into #root and loads the main TypeScript module.",
  "frontend/src/App.tsx": "Root React component that controls the intro → game → outro phase transitions via local state.",
  "frontend/src/content/story.ts": "Structured story data defining the intro narrative steps, goal blocks, slider question, statistics, and Donald storyline content.",
  "frontend/src/features/game/CollectiblesHud.tsx": "HUD component showing the number of collected stars out of the total using an icon and counter.",
  "frontend/src/features/game/GameView.tsx": "Core top-down game component handling movement, camera, collisions, collectibles, modals, HUD, and triggering the outro after the final unique star pickup.",
  "frontend/src/features/game/GoalsModal.tsx": "Modal dialog introducing Donald’s goals and the player’s objective, dismissible via button or Escape key.",
  "frontend/src/features/game/jokes.ts": "Exports a fixed list of five goal-related jokes used during gameplay.",
  "frontend/src/features/game/MobilePhoneModal.tsx": "Empty file reserved for a future modal related to the mobile phone collectible.",
  "frontend/src/features/game/passability.ts": "Defines collision and corridor passability utilities, computing guaranteed obstacle-free channels for corridor segments and junctions. Provides AABB intersection checks to ensure obstacles do not block the player’s traversable path.",
  "frontend/src/features/game/SpeechBalloon.tsx": "UI component that renders a positioned speech balloon above the character while keeping it within canvas bounds.",
  "frontend/src/features/game/StarPickupModal.tsx": "Modal shown when a star is collected, displaying its title and description and an optional completion message for the 7th unique pickup.",
  "frontend/src/features/game/useGameLoop.ts": "Implements a React hook that runs a requestAnimationFrame-based game loop and invokes an onUpdate callback with delta time. Manages frame scheduling and cleanup automatically.",
  "frontend/src/features/game/useKeyboardControls.ts": "Provides a React hook for handling keyboard input, tracking arrow-key movement state and triggering callbacks on spacebar or 'j' presses. Supports disabling input and cleans up global event listeners.",
  "frontend/src/features/game/worldMap.ts": "Defines world map types and generates a random, guaranteed-passable corridor path with obstacles and collision helpers. Integrates passability validation to ensure the corridor remains traversable.",
  "frontend/src/features/intro/GoalStickinessQuestion.tsx": "Renders an intro slider question with feedback logic and delayed continuation. Manages submission state, feedback messaging, and a timed Continue button.",
  "frontend/src/features/intro/introBackground.ts": "Generates dynamic CSS gradients for the intro background based on progression, interpolating from light to dark tones. Exposes a final fully darkened gradient for the game view.",
  "frontend/src/features/intro/IntroFlow.tsx": "Controls the multi-stage intro narrative flow, revealing text lines over time and transitioning between stages with buttons. Manages background gradient darkening and timing-based animations.",
  "frontend/src/features/outro/OutroFlow.tsx": "Implements the outro narrative flow with two timed text blocks revealed line-by-line, a gated Continue button between blocks, and animated transitions over the final intro gradient background.",
  "frontend/src/hooks/useActor.ts": "Provides a React Query hook that creates and caches an identity-aware backend actor (or anonymous actor) and invalidates dependent queries when the identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Defines an Internet Identity context and provider that manages authentication state, login/logout, persisted identities, and exposes status flags via a custom hook.",
  "frontend/src/index.css": "Sets up Tailwind base styles, CSS variables for the OKLCH color system and theming (light/dark), global typography, and a few custom utility animations.",
  "frontend/src/main.tsx": "Application entry point that renders the React app, wiring up React Query and Internet Identity providers and importing global styles.",
  "frontend/tailwind.config.js": "Tailwind configuration defining content paths, dark mode strategy, extended theme tokens mapped to CSS variables, animations, and plugins.",
  "project_state.json": "Machine-readable snapshot of the project’s current architecture and features, describing the intro-to-game-to-outro flow, gameplay mechanics, and authentication scaffolding."
}