{
  "backend/main.mo": "Minimal Motoko canister entry point defining an empty actor with no state or methods.",
  "feature_evidence.json": "Structured report listing implemented product features, affected frontend files, component dependencies, test IDs, and confidence levels.",
  "frontend-file-summaries.txt": "Reference document mapping frontend file paths to concise human-written summaries of their responsibilities.",
  "frontend/index.css": "Global Tailwind CSS setup defining design tokens, OKLCH color variables for light/dark themes, and base element styling.",
  "frontend/index.html": "HTML entry point that mounts the React app to #root and loads the Vite main.tsx module.",
  "frontend/src/App.tsx": "Root React component that toggles between the intro narrative flow and the game view based on local state.",
  "frontend/src/content/story.ts": "Typed story data defining all intro narrative steps, including opening text, goal blocks, slider question, stat reveal, and Donald narrative blocks.",
  "frontend/src/features/game/GameView.tsx": "Canvas-based 2D game view rendering a Zelda-inspired scrolling terrain, controllable pixel-art character, and timed joke speech balloons using a deltaTime game loop.",
  "frontend/src/features/game/jokes.ts": "Exports a fixed array of five predefined jokes used during gameplay.",
  "frontend/src/features/game/SpeechBalloon.tsx": "UI component that renders an animated speech balloon positioned above the character while clamping within canvas bounds.",
  "frontend/src/features/game/useGameLoop.ts": "Custom React hook that runs a requestAnimationFrame loop and provides frame-independent deltaTime updates.",
  "frontend/src/features/game/useKeyboardControls.ts": "Custom React hook that tracks arrow-key movement state and triggers a callback on spacebar presses with proper event cleanup.",
  "frontend/src/features/intro/GoalStickinessQuestion.tsx": "React component that asks a slider-based question, provides immediate feedback based on the selected percentage, and reveals a Continue button after a timed delay before calling onSubmit.",
  "frontend/src/features/intro/introBackground.ts": "Utility that computes a CSS linear-gradient string, interpolating from a light playful gradient to a darker, colder one based on progression through darkening steps.",
  "frontend/src/features/intro/IntroFlow.tsx": "State-driven intro narrative flow that progressively reveals story text, buttons, and a slider question while transitioning background gradients based on darkening steps, and calls onComplete at the end.",
  "frontend/src/hooks/useActor.ts": "Custom hook that creates and caches a backend actor using react-query, switching between anonymous and authenticated actors based on Internet Identity and invalidating dependent queries on change.",
  "frontend/src/hooks/useInternetIdentity.ts": "Context provider and hook that manage Internet Identity authentication state, login/logout actions, and AuthClient setup with persistence across reloads.",
  "frontend/src/index.css": "Global Tailwind CSS setup defining design tokens via CSS variables for light and dark themes, base styles, fonts, and a few custom utility animations.",
  "frontend/src/main.tsx": "Application entry point that renders the React app with QueryClientProvider and InternetIdentityProvider wrappers and loads global styles.",
  "frontend/tailwind.config.js": "Tailwind configuration enabling dark mode, plugins, container settings, and an extended theme that maps CSS variables to colors, radii, fonts, and animations.",
  "project_state.json": "High-level snapshot of the project’s current state, describing a React + TypeScript SPA with a staged, animated intro narrative that transitions into a simple 2D canvas game. It enumerates existing implemented features, including intro flow mechanics, animations, story configuration, gameplay basics, and scaffolding for Dfinity authentication and backend integration."
}