{
  "kind": "build_request",
  "title": "Fix gameplay audio resume, add pre-game sound reminder line, and ensure Wall of Fame loads from link",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-11",
      "text": "Fix the gameplay background music resume behavior so that after the star-collection sound pauses the background music, the background music reliably resumes playback (instead of sometimes remaining paused).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "The background music sometimes doesn't restart after it's been paused for the star collection soundtrack."
        ]
      },
      "acceptanceCriteria": [
        "During gameplay, collecting a star pauses the background music and then the background music resumes reliably afterward (no intermittent failure to resume).",
        "Rapidly collecting multiple stars does not permanently stop the background music (it still resumes after the most recent pause window completes).",
        "No new user-facing text is added as part of this fix."
      ]
    },
    {
      "id": "REQ-12",
      "text": "Update the pre-game narrative section that begins with \"This particular Barnabus's journey is not that long.\" by appending an additional final line: \"Also, it's recommended for you to turn on sound.\"",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "To the section that starts with \"This particular Barnabus's journey is not that long.\" add additional message at the end of current ones: \"Also, it's recommended for you to turn on sound.\"."
        ]
      },
      "acceptanceCriteria": [
        "The pre-game block displays the new line after the existing lines in that same section.",
        "The new line matches exactly: \"Also, it's recommended for you to turn on sound.\""
      ]
    },
    {
      "id": "REQ-13",
      "text": "Fix the Wall of Fame (Hall of Fame) screen so that opening it via the \"Wall of Fame\" link shows the persisted entries immediately (without requiring the user to first finish the game and submit a name).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "Also if I open wall of fame from the link, it doesn't show any entries. However, if I finished the game, input my name, then it shows other entries as well."
        ]
      },
      "acceptanceCriteria": [
        "When navigating to the Wall of Fame via the link, the list fetches and renders the same persisted entries that are visible after completing the game and submitting a name.",
        "The Wall of Fame screen does not render an empty list due to caching/disabled-query/actor-initialization timing issues; it either shows a loading indicator while fetching or shows the fetched entries.",
        "This fix works for anonymous (not logged in) users as well as authenticated users."
      ]
    }
  ],
  "constraints": [
    "Do not edit files under frontend.immutablePaths (compose existing hooks/components instead).",
    "Respect the single-actor backend architecture; do not introduce additional backend services.",
    "Use English for any user-facing text."
  ],
  "nonGoals": [
    "Do not change the Wall of Fame storage schema or introduce new backend persistence mechanisms beyond what is required for the loading bug.",
    "Do not redesign the Wall of Fame UI beyond what is necessary to ensure entries load and display correctly.",
    "Do not add new audio tracks or new sound effects; only fix the existing resume reliability issue."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}