{
  "kind": "build_request",
  "title": "Use provided PDF template for certificate (overlay name on underscores) + center Wall of Fame names in 3 columns",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-11",
      "text": "Update certificate generation so the downloaded certificate uses the user-provided PDF template as the base certificate page, and dynamically overlays the player’s name centered horizontally over the underscore area at the top of that PDF.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-8",
          "msg-10"
        ],
        "quotes": [
          "At the top of the PDF there are multiple _ (underscore) symbols. When preparing the certificate, place player's name right on top of those underscores.",
          "center horizontally"
        ]
      },
      "acceptanceCriteria": [
        "Clicking the existing “Download Your Certificate” button downloads a valid PDF file (application/pdf).",
        "The downloaded PDF visually matches the provided template for the certificate page (no re-rendered custom background/borders replacing it).",
        "The player name is rendered on top of (overlapping) the underscore line region and is centered horizontally relative to that underscore region.",
        "The name overlay is computed at download-time from the entry being downloaded (i.e., it works for different names without rebuilding the app)."
      ]
    },
    {
      "id": "REQ-12",
      "text": "Preserve the existing Key Takeaways certificate behavior by keeping the Key Takeaways content included as an additional page after the template-based certificate page (unless the provided template PDF already includes its own additional pages, in which case append the Key Takeaways page after the template’s pages).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-8",
          "msg-10"
        ],
        "quotes": [
          "here's pdf with for the certificate",
          "dynamically"
        ]
      },
      "acceptanceCriteria": [
        "The downloaded PDF contains the template-based certificate page with the name overlay plus the existing Key Takeaways page content.",
        "Key Takeaways page continues to list all takeaways with their body content and link text/URL when present."
      ]
    },
    {
      "id": "REQ-13",
      "text": "In the Wall of Fame list, center player names horizontally within each of the three columns while keeping the existing 3-column layout unchanged.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-8",
          "msg-10"
        ],
        "quotes": [
          "in the Wall of Fame, center the text (player names) horizontally in columns",
          "yes"
        ]
      },
      "acceptanceCriteria": [
        "Wall of Fame entries remain displayed in three columns at desktop widths as they are currently.",
        "Within each column cell, the rendered entry text (including the number and the name) is horizontally centered."
      ]
    }
  ],
  "constraints": [
    "Do not edit files under frontend/immutablePaths (compose existing UI components instead).",
    "Respect the existing single-actor backend architecture; no additional backend canisters/services.",
    "Keep all user-facing text in English."
  ],
  "nonGoals": [
    "Do not introduce third-party auth providers (only Internet Identity is supported).",
    "Do not change Wall of Fame persistence behavior or backend schema as part of this request.",
    "Do not redesign the Wall of Fame layout beyond centering text within the existing three-column grid."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}