{
  "kind": "build_request",
  "title": "Update HTML title and restrict certificate download to completed players",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-20",
      "text": "Update the HTML document title in frontend/index.html so the <title> content is exactly \"Barnabus, The Undeterred\".",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-5",
          "msg-6"
        ],
        "quotes": [
          "In index.html there is title element. Please update it's content to \"Barnabus, The Undeterred\"."
        ]
      },
      "acceptanceCriteria": [
        "frontend/index.html contains <title>Barnabus, The Undeterred</title>.",
        "After reload, the browser tab title displays \"Barnabus, The Undeterred\"."
      ]
    },
    {
      "id": "REQ-21",
      "text": "Remove the Wall of Fame testing behavior that allows downloading a certificate without completing the game: only render the \"Download Your Certificate\" button when the local completion flag indicates the player has completed the game (hasCompleted === true).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-5",
          "msg-6"
        ],
        "quotes": [
          "We're done testing the certificates, so you can now remove the functionality where I can download the certificate even if I haven't completed the game (don't show the button)."
        ]
      },
      "acceptanceCriteria": [
        "If hasCompleted is false, HallOfFameView does not render the \"Download Your Certificate\" button at all.",
        "If hasCompleted is true, HallOfFameView renders the \"Download Your Certificate\" button."
      ]
    },
    {
      "id": "REQ-22",
      "text": "When the certificate download button is shown (player has completed), generate the certificate using the completed player's Wall of Fame entry (playerEntry) rather than the last entry in the list; if no matching player entry is found, keep the button disabled.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-5",
          "msg-6"
        ],
        "quotes": [
          "remove the functionality where I can download the certificate even if I haven't completed the game (don't show the button)."
        ]
      },
      "acceptanceCriteria": [
        "When hasCompleted is true and the player’s entry exists in the fetched entries, clicking the button downloads a certificate for that player’s name.",
        "When hasCompleted is true but no playerEntry is found, the button is rendered but disabled."
      ]
    }
  ],
  "constraints": [
    "Do not edit any files under frontend/src/components/ui (Shadcn components are read-only).",
    "Do not modify frontend/src/hooks/useInternetIdentity.ts, frontend/src/hooks/useInternetIdentity.tsx, frontend/src/hooks/useActor.ts, or frontend/src/main.tsx (immutable paths)."
  ],
  "nonGoals": [
    "Do not add or change backend (Motoko) APIs or persistence behavior as part of this request.",
    "Do not address intermittent canister-stopped/service-unavailable errors beyond the existing Wall of Fame error UI."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}