{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Gameplay audio resume reliability, pre-game sound reminder line, and Wall of Fame initial load fix",
  "requirements": [
    {
      "id": "REQ-11",
      "summary": "Make background music reliably resume after the star-collection sound pauses it, including during rapid consecutive star pickups.",
      "acceptanceCriteria": [
        "During gameplay, collecting a star pauses the background music and then the background music resumes reliably afterward (no intermittent failure to resume).",
        "Rapidly collecting multiple stars does not permanently stop the background music (it still resumes after the most recent pause window completes).",
        "No new user-facing text is added as part of this fix."
      ],
      "file_operations": [
        {
          "path": "frontend/src/features/game/useGameplayAudio.ts",
          "operation": "modify",
          "description": "Fix resume timing so background music resume is scheduled deterministically even when the star sound's play() does not return a Promise (or resolves unpredictably). Ensure rapid star pickups cancel/replace prior resume schedules (e.g., via a monotonic resume token or last-request-wins logic) and that resume attempts re-trigger playback safely without leaving the music paused."
        },
        {
          "path": "frontend/src/features/game/GameView.tsx",
          "operation": "modify",
          "description": "Confirm the gameplay flow triggers the updated audio hook correctly for star collection events and that no additional UI text is introduced while validating the resumed playback behavior during gameplay."
        }
      ]
    },
    {
      "id": "REQ-12",
      "summary": "Append the exact sound reminder line to the specified pre-game narrative section.",
      "acceptanceCriteria": [
        "The pre-game block displays the new line after the existing lines in that same section.",
        "The new line matches exactly: \"Also, it's recommended for you to turn on sound.\""
      ],
      "file_operations": [
        {
          "path": "frontend/src/content/story.ts",
          "operation": "modify",
          "description": "Append the final line \"Also, it's recommended for you to turn on sound.\" to the existing preGameBlock that begins with \"This particular Barnabus's journey is not that long.\" ensuring ordering matches the requirement."
        },
        {
          "path": "frontend/src/features/intro/IntroFlow.tsx",
          "operation": "modify",
          "description": "Verify the pre-game narrative rendering uses the updated preGameBlock and that the appended line appears as the final line of that section without altering unrelated copy."
        }
      ]
    },
    {
      "id": "REQ-13",
      "summary": "Ensure Wall of Fame loads persisted entries immediately when opened via the Wall of Fame link, with proper loading state and working for anonymous users.",
      "acceptanceCriteria": [
        "When navigating to the Wall of Fame via the link, the list fetches and renders the same persisted entries that are visible after completing the game and submitting a name.",
        "The Wall of Fame screen does not render an empty list due to caching/disabled-query/actor-initialization timing issues; it either shows a loading indicator while fetching or shows the fetched entries.",
        "This fix works for anonymous (not logged in) users as well as authenticated users."
      ],
      "file_operations": [
        {
          "path": "frontend/src/hooks/useQueries.ts",
          "operation": "modify",
          "description": "Adjust the Wall of Fame query to avoid actor-timing-related disabled-query states (e.g., remove dependency on an in-flight actor fetch flag for enabling; include an actor-specific stable key if needed). Ensure the query reliably fetches once an anonymous/authenticated actor is ready and does not get stuck returning an empty list due to initialization timing."
        },
        {
          "path": "frontend/src/features/hall-of-fame/HallOfFameView.tsx",
          "operation": "modify",
          "description": "Update the Wall of Fame view to treat the initial fetch as a loading state (not an empty list) when navigation happens before data is available. Ensure the view renders a loading indicator while fetching and then renders fetched persisted entries once available for both anonymous and authenticated users."
        },
        {
          "path": "frontend/src/components/WallOfFameLink.tsx",
          "operation": "modify",
          "description": "Verify link navigation wiring triggers the Hall of Fame screen in a way that mounts the data-fetching view and results in entries being fetched immediately upon navigation (no dependency on finishing the game first)."
        }
      ]
    }
  ]
}