{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Title update + certificate download gating by completion",
  "requirements": [
    {
      "id": "REQ-20",
      "summary": "Set the HTML document title to the requested game name.",
      "acceptanceCriteria": [
        "frontend/index.html contains <title>Barnabus, The Undeterred</title>.",
        "After reload, the browser tab title displays \"Barnabus, The Undeterred\"."
      ],
      "file_operations": [
        {
          "path": "frontend/index.html",
          "operation": "modify",
          "description": "Replace the existing <title> text so it is exactly \"Barnabus, The Undeterred\"."
        }
      ]
    },
    {
      "id": "REQ-21",
      "summary": "Remove Wall of Fame testing behavior so the certificate download button only appears for completed players.",
      "acceptanceCriteria": [
        "If hasCompleted is false, HallOfFameView does not render the \"Download Your Certificate\" button at all.",
        "If hasCompleted is true, HallOfFameView renders the \"Download Your Certificate\" button."
      ],
      "file_operations": [
        {
          "path": "frontend/src/features/hall-of-fame/HallOfFameView.tsx",
          "operation": "modify",
          "description": "Remove the testing logic that always shows the download button; conditionally render the \"Download Your Certificate\" Button only when hasCompleted === true (using the local completion flag from usePersistentPlayerId)."
        }
      ]
    },
    {
      "id": "REQ-22",
      "summary": "Generate certificates from the completed player's own Wall of Fame entry and disable download when no matching entry exists.",
      "acceptanceCriteria": [
        "When hasCompleted is true and the player’s entry exists in the fetched entries, clicking the button downloads a certificate for that player’s name.",
        "When hasCompleted is true but no playerEntry is found, the button is rendered but disabled."
      ],
      "file_operations": [
        {
          "path": "frontend/src/features/hall-of-fame/HallOfFameView.tsx",
          "operation": "modify",
          "description": "Update certificate download behavior to use playerEntry (matched by playerId) instead of the last entry; wire the button disabled state to !playerEntry while still rendering it when hasCompleted === true; update the click handler to no-op unless playerEntry exists and generateCertificatePdf is called with playerEntry.name."
        }
      ]
    }
  ]
}