{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Template-based certificate PDF with name overlay + centered Wall of Fame columns",
  "requirements": [
    {
      "id": "REQ-11",
      "summary": "Use the provided PDF template as the certificate base and overlay the player name centered over the underscore region at download-time.",
      "acceptanceCriteria": [
        "Clicking the existing “Download Your Certificate” button downloads a valid PDF file (application/pdf).",
        "The downloaded PDF visually matches the provided template for the certificate page (no re-rendered custom background/borders replacing it).",
        "The player name is rendered on top of (overlapping) the underscore line region and is centered horizontally relative to that underscore region.",
        "The name overlay is computed at download-time from the entry being downloaded (i.e., it works for different names without rebuilding the app)."
      ],
      "file_operations": [
        {
          "path": "frontend/public/assets/certificate-of-achievament.pdf",
          "operation": "create",
          "description": "Add the provided certificate PDF template to the public assets so it can be fetched at runtime for template-based certificate generation."
        },
        {
          "path": "frontend/src/features/hall-of-fame/certificatePdf.ts",
          "operation": "modify",
          "description": "Replace the current manual-PDF-string generation with logic that loads the template PDF from frontend/public/assets/certificate-of-achievament.pdf at download-time, then overlays the provided player name as text on the first template page positioned to overlap the underscore region and centered horizontally within that region."
        },
        {
          "path": "frontend/package.json",
          "operation": "modify",
          "description": "Add/update any required frontend PDF manipulation dependency used to load the template PDF, draw the name overlay, and output a valid application/pdf Blob for download."
        }
      ]
    },
    {
      "id": "REQ-12",
      "summary": "Keep Key Takeaways as an additional page appended after the template PDF pages.",
      "acceptanceCriteria": [
        "The downloaded PDF contains the template-based certificate page with the name overlay plus the existing Key Takeaways page content.",
        "Key Takeaways page continues to list all takeaways with their body content and link text/URL when present."
      ],
      "file_operations": [
        {
          "path": "frontend/src/features/hall-of-fame/certificatePdf.ts",
          "operation": "modify",
          "description": "Update PDF assembly so that after loading the template PDF (which may contain multiple pages), the existing Key Takeaways content is rendered into a new page and appended after all template pages, preserving titles, body text, and link text/URL when present."
        },
        {
          "path": "frontend/src/features/outro/takeawaysContent.ts",
          "operation": "modify",
          "description": "Ensure the Key Takeaways data structure remains compatible with certificate PDF rendering (titles, body, optional link text/URL) and adjust only if needed to support consistent PDF output without changing user-facing English text."
        }
      ]
    },
    {
      "id": "REQ-13",
      "summary": "Center Wall of Fame entry text horizontally within each of the three existing columns.",
      "acceptanceCriteria": [
        "Wall of Fame entries remain displayed in three columns at desktop widths as they are currently.",
        "Within each column cell, the rendered entry text (including the number and the name) is horizontally centered."
      ],
      "file_operations": [
        {
          "path": "frontend/src/features/hall-of-fame/HallOfFameView.tsx",
          "operation": "modify",
          "description": "Adjust the Wall of Fame entry cell styling so each item’s number+name text is horizontally centered within its column while preserving the existing responsive 3-column grid layout at desktop widths."
        }
      ]
    }
  ]
}