{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Space game: push first star farther from spawn and update controls legend",
  "requirements": [
    {
      "id": "REQ-11",
      "summary": "Ensure the first generated collectible star spawns meaningfully farther (downward) from the player spawn so it cannot be reached immediately on a fresh load, while keeping 7 total stars safely inside the corridor.",
      "acceptanceCriteria": [
        "On a fresh game load, the closest uncollected star is not within immediate reach of the spawn area (i.e., the player must travel noticeably downward before encountering the first star).",
        "The game still generates 7 total collectible stars and they remain inside the corridor and not intersecting obstacles."
      ],
      "file_operations": [
        {
          "path": "frontend/src/features/game/worldMap.ts",
          "operation": "modify",
          "description": "Adjust collectible generation to deterministically place the first collectible (i=0) at a minimum downward distance from the spawn position (e.g., enforce a configurable minY offset from getSpawnPosition()), using a bounded search for a valid (inside-corridor, non-intersecting-obstacles) location before generating the remaining 6 stars as today to preserve total count and corridor safety."
        }
      ]
    },
    {
      "id": "REQ-12",
      "summary": "Update the controls legend under the canvas to say “Space to act” (and change nothing else).",
      "acceptanceCriteria": [
        "The controls legend displays: “Arrow keys to move • Space to act • J to tell a joke”.",
        "No other gameplay control text is changed."
      ],
      "file_operations": [
        {
          "path": "frontend/src/features/game/GameView.tsx",
          "operation": "modify",
          "description": "Update the controls legend string rendered under the canvas by changing only the phrase “Space to act & collect stars” to “Space to act”, leaving the rest of the legend text unchanged."
        }
      ]
    }
  ]
}