{
  "schemaVersion": "1.0.0",
  "projectStateVersion": 3,
  "summary": "A React + TypeScript single-page narrative experience/game titled “Barnabus, The Undeterred”. The app runs a timed, stage-based intro story with dynamic OKLCH gradient transitions, then a top-down 2D Canvas corridor exploration mini-game where the player moves Barnabus, triggers an action spin, collects 7 star collectibles (showing a per-pickup modal and a completion trigger on the 7th), and can press J to display random jokes in a speech balloon. After completion, an outro narrative reveals 7 takeaways (with modal details) and optionally prompts for the player’s name to submit to an ICP (Motoko) backend “Wall of Fame”. The Wall of Fame view fetches and displays entries with loading/error/empty states and allows downloading a client-side generated certificate PDF based on a template.",
  "existing_features": [
    {
      "id": "IF-1",
      "title": "Phase-based SPA flow (intro → game → outro → Wall of Fame)",
      "synonyms": [
        "AppPhase state machine",
        "phase navigation"
      ],
      "description": "Top-level App component switches between IntroFlow, GameView, OutroFlow, and HallOfFameView using internal state and callbacks to advance between phases or return to start.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-2",
      "title": "Structured intro story content module",
      "synonyms": [
        "content/story.ts",
        "StoryStep model"
      ],
      "description": "Intro narrative copy is organized into typed story steps/blocks (opening, goals blocks, negativity block, slider question, stat, Barnabus blocks, pre-game block) for consistent staged rendering.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-3",
      "title": "Timed intro narrative with staged progression and gated CTAs",
      "synonyms": [
        "IntroFlow stages",
        "line-by-line reveal"
      ],
      "description": "IntroFlow reveals narrative lines on timers, progresses through explicit stages, includes a slider interaction step, and gates progression via Continue/Start actions.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-4",
      "title": "Dynamic intro/outro background gradients with smooth crossfade transitions",
      "synonyms": [
        "getBackgroundGradient",
        "darkening/lightening index",
        "layered gradient crossfade"
      ],
      "description": "Background uses computed OKLCH gradients that darken during intro and lighten during outro, with layered div opacity transitions for smooth crossfades.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-5",
      "title": "Intro Wall of Fame quick link",
      "synonyms": [
        "WallOfFameLink",
        "top-right link"
      ],
      "description": "A fixed-position “Wall of Fame” link appears only on the earliest intro stage and navigates directly to the Wall of Fame view.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-6",
      "title": "Goal stickiness slider question with feedback and delayed continue",
      "synonyms": [
        "GoalStickinessQuestion",
        "range slider prompt"
      ],
      "description": "A 1–100 slider captures a guess, shows conditional feedback text, and reveals a Continue button after a fixed delay to match narrative pacing.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-7",
      "title": "Top-down 2D Canvas gameplay with world-space camera transform",
      "synonyms": [
        "GameView",
        "Canvas2D camera follow"
      ],
      "description": "Renders a corridor world on a canvas using camera translation so the player moves in world coordinates while the camera follows smoothly.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-8",
      "title": "Frame-independent game loop (requestAnimationFrame + delta time)",
      "synonyms": [
        "useGameLoop",
        "deltaTime updates"
      ],
      "description": "A custom hook runs a requestAnimationFrame loop and supplies deltaTime in seconds to update movement, animation, and camera consistently across frame rates.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-9",
      "title": "Global keyboard controls with modal gating and Space repeat prevention",
      "synonyms": [
        "useKeyboardControls",
        "Arrow movement / Space action / J joke"
      ],
      "description": "Window-level keyboard handling supports arrow movement, Space action, and J for jokes; input is disabled and movement state is cleared while modals are open; Space repeat events are ignored to prevent rapid firing.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-10",
      "title": "Procedural corridor world generation with passability guarantees",
      "synonyms": [
        "worldMap corridor path",
        "guaranteed channel",
        "BFS validation"
      ],
      "description": "Generates a random corridor composed of 90° segments; walls and interior obstacles are placed while preserving a guaranteed-clearance channel and validated for traversability via grid-based BFS.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-11",
      "title": "World bounds clamping, obstacle collision, and wall sliding",
      "synonyms": [
        "clampToWorldBounds",
        "checkCollision",
        "axis-separated sliding"
      ],
      "description": "Player movement is clamped to computed world bounds and uses AABB collision checks; on collision it attempts axis-only movement to slide along obstacles for better feel.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-12",
      "title": "World rendering of tiles, grid lines, and obstacle styling",
      "synonyms": [
        "TILE_REGIONS",
        "OBSTACLES rendering"
      ],
      "description": "Gameplay draws corridor floor tile regions, subtle grid lines, and styled obstacles (walls as rectangles; rocks/trees as circles with additional detailing).",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-13",
      "title": "Character sprite loading with fallback rendering",
      "synonyms": [
        "pixel sprite",
        "fallback silhouette"
      ],
      "description": "Attempts to load a pixel-art character image with image smoothing disabled; if loading fails, renders a simple pixel-art fallback silhouette so gameplay remains functional.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-14",
      "title": "Collectibles system (7 stars) with HUD counter",
      "synonyms": [
        "getCollectibles",
        "CollectiblesHud"
      ],
      "description": "Generates and tracks seven uniquely-identified collectibles; renders them as gold stars and displays a top-right HUD counter (X / 7).",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-15",
      "title": "Space action spin animation with proximity-based pickup",
      "synonyms": [
        "spin action",
        "pickup radius"
      ],
      "description": "Pressing Space triggers a timed spin animation and can collect at most one nearby uncollected star within a tight pickup radius per press.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-16",
      "title": "Per-star pickup modal and completion trigger on 7th pickup",
      "synonyms": [
        "StarPickupModal",
        "final pickup completion"
      ],
      "description": "Collecting a star opens a modal with collectible-specific title/description; the 7th pickup is treated as completion and, on dismissal, triggers transition to the outro (guarded to fire once).",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-17",
      "title": "Gameplay goals modal shown on entry and blocks input",
      "synonyms": [
        "GoalsModal",
        "start-of-game overlay"
      ],
      "description": "A goals/mission modal is shown immediately on gameplay entry; movement/actions are paused until dismissed (Escape supported).",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-18",
      "title": "Joke system with speech balloon anchored near the character",
      "synonyms": [
        "SpeechBalloon",
        "jokes.ts"
      ],
      "description": "Pressing J shows a random joke in a speech balloon positioned above the character (screen space), clamped within canvas bounds, and auto-hides after 3 seconds.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-19",
      "title": "Gameplay audio: background music with autoplay retry and SFX",
      "synonyms": [
        "useGameplayAudio",
        "background.mp3",
        "star-collected.mp3",
        "action-space.mp3"
      ],
      "description": "Manages looping background music with retry on first user interaction if autoplay is blocked; plays an action SFX on Space; plays a quieter star-collection SFX that pauses background music and resumes deterministically after 4.5s using a token-based last-request-wins timeout approach.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-20",
      "title": "Timed outro narrative flow with gradient lightening",
      "synonyms": [
        "OutroFlow stages",
        "TOTAL_INTRO_DARKENING_STEPS reversal"
      ],
      "description": "Outro reveals narrative blocks line-by-line on timers while gradually lightening the background gradient to mirror/reverse the intro darkening progression.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-21",
      "title": "Takeaways list reveal and takeaway modal with centralized content",
      "synonyms": [
        "TakeawayModal",
        "takeawaysContent.ts"
      ],
      "description": "Seven takeaways are revealed incrementally; selecting one opens a modal that looks up body text and optional external links from a centralized TAKEAWAYS content module (Escape and overlay click supported).",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-22",
      "title": "Name submission modal with validation, loading/error states, and skip flow",
      "synonyms": [
        "NameSubmissionModal",
        "skip to Wall of Fame"
      ],
      "description": "A modal collects a non-empty player name, disables close while submitting, prevents outside interaction, shows errors with a dismiss action, and offers a skip path to the Wall of Fame view.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-23",
      "title": "Persistent player ID and completion flag stored in localStorage",
      "synonyms": [
        "usePersistentPlayerId",
        "barnabus_player_id",
        "barnabus_completed"
      ],
      "description": "Persists a submitted Wall of Fame entry ID (as BigInt) and a completion flag in localStorage for reload survival, with helpers to set/clear and mark completion.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-24",
      "title": "Internet Identity authentication context (AuthClient)",
      "synonyms": [
        "InternetIdentityProvider",
        "useInternetIdentity"
      ],
      "description": "Provides an Internet Identity context that initializes AuthClient, restores a saved delegation if authenticated, and exposes login/logout plus status flags.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-25",
      "title": "Identity-aware ICP backend actor creation with query invalidation",
      "synonyms": [
        "useActor",
        "anonymous vs authenticated actor"
      ],
      "description": "Creates an ICP backend actor either anonymously or with the current Internet Identity; when the actor becomes available/changes, non-actor queries are invalidated and refetched.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-26",
      "title": "Wall of Fame React Query hooks (fetch + optimistic add)",
      "synonyms": [
        "useWallOfFame",
        "useAddWallOfFameEntry"
      ],
      "description": "Fetches Wall of Fame entries only after an actor exists (always refetch on mount). Provides a mutation that generates an ID, adds an entry, optimistically updates the cached list, and then invalidates queries for consistency.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-27",
      "title": "Wall of Fame screen with loading/error/empty states, retry, and entry highlighting",
      "synonyms": [
        "HallOfFameView",
        "IC0508 stopped-canister messaging"
      ],
      "description": "Displays entries in a responsive grid; highlights the player’s entry when a completed playerId is known; provides back-to-start navigation; shows loading/empty states; and provides a Retry button in error state with friendly messaging when the canister appears stopped/unavailable.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-28",
      "title": "Certificate PDF generation from template with sanitized filename",
      "synonyms": [
        "generateCertificatePdf",
        "pdf-lib via CDN",
        "certificate-v2.pdf",
        "sanitizeCertificateFilename"
      ],
      "description": "Loads a static certificate template PDF, overlays the player name in white using HelveticaBold centered horizontally and positioned at ~66% page height, then triggers a download using a sanitized filename derived from the player’s name.",
      "reqIds": [
        "REQ-18",
        "REQ-19"
      ],
      "version": 2
    },
    {
      "id": "IF-29",
      "title": "Motoko backend API for Wall of Fame entries",
      "synonyms": [
        "backend/main.mo",
        "addEntry/getAllEntries/generateId"
      ],
      "description": "Motoko canister stores WallOfFameEntry records in memory and exposes methods to add entries, list entries, count entries, and generate sequential numeric IDs.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "feature-update-the-html-document-title-in-frontend-index-html-so-the-title-content-is-exactly-barnabus-the-undeterred",
      "title": "Update the HTML document title in frontend/index.html so the <title> content is exactly \"Barnabus, The Undeterred\".",
      "reqIds": [
        "REQ-20"
      ],
      "version": 1
    },
    {
      "id": "feature-remove-the-wall-of-fame-testing-behavior-that-allows-downloading-a-certificate-without-completing-the-game-only-render-the-download-your-certificate-button-when-the-local-completion-flag-indicates-the-player-has-completed-the-game-hascompleted-true",
      "title": "Remove the Wall of Fame testing behavior that allows downloading a certificate without completing the game: only render the \"Download Your Certificate\" button when the local completion flag indicates the player has completed the game (hasCompleted === true).",
      "reqIds": [
        "REQ-21"
      ],
      "version": 1
    },
    {
      "id": "feature-when-the-certificate-download-button-is-shown-player-has-completed-generate-the-certificate-using-the-completed-player-s-wall-of-fame-entry-playerentry-rather-than-the-last-entry-in-the-list-if-no-matching-player-entry-is-found-keep-the-button-disabled",
      "title": "When the certificate download button is shown (player has completed), generate the certificate using the completed player's Wall of Fame entry (playerEntry) rather than the last entry in the list; if no matching player entry is found, keep the button disabled.",
      "reqIds": [
        "REQ-22"
      ],
      "version": 1
    }
  ],
  "new_feature_requests": [
    {
      "id": "AR-1",
      "summary": "Update index.html <title> to \"Barnabus, The Undeterred\"",
      "reqIds": [],
      "status": "pending"
    },
    {
      "id": "AR-2",
      "summary": "Remove testing mode for certificate download; only show Download Certificate button when the player has completed the game",
      "reqIds": [],
      "status": "pending"
    }
  ],
  "architectural_notes": [
    "App navigation is implemented as an App-level phase state machine (intro → game → outro → hall-of-fame) rather than URL routing.",
    "Feature-oriented frontend structure (intro/game/outro/hall-of-fame) with shared hooks for identity, actor creation, persistence, and queries.",
    "Canvas2D gameplay uses imperative rendering; fast-changing simulation state (character, camera, collectibles) is stored in refs to avoid React re-render thrash.",
    "Frame loop is implemented with a custom requestAnimationFrame hook providing deltaTime (seconds) for frame-rate-independent movement/animation.",
    "Procedural corridor generation is constrained by a guaranteed-clearance channel and validated via grid/BFS passability checks.",
    "Keyboard input is handled globally via a dedicated hook with modal gating and Space repeat-prevention.",
    "Gameplay audio is encapsulated in a hook with stable callbacks and deterministic pause/resume logic (token-based last-request-wins).",
    "ICP integration uses an Internet Identity (AuthClient) context and an identity-aware actor creation hook.",
    "TanStack React Query manages backend calls, including optimistic cache updates for Wall of Fame mutations and invalidation/refetch when the actor changes.",
    "Certificate generation is fully client-side: loads a static PDF template and injects text; pdf-lib is loaded dynamically from a CDN at runtime."
  ],
  "known_issues": [
    "Motoko backend stores Wall of Fame entries in a non-stable variable, so entries will not persist across canister upgrades despite the frontend’s persistence verification notes.",
    "backend.generateId() is derived from current array size and is not concurrency-safe; near-simultaneous submissions can produce duplicate IDs.",
    "Backend has no validation/auth/rate limiting for Wall of Fame entries (any caller can add arbitrary names, including duplicates).",
    "HallOfFameView’s certificate download uses the last entry in the list (lastEntry) rather than the detected current player entry (playerEntry).",
    "GameView accepts an onNavigateToHallOfFame prop but never calls it, leaving no in-game navigation path to the Wall of Fame despite the prop existing.",
    "frontend/src/features/game/MobilePhoneModal.tsx is empty (placeholder), and some comments/summaries reference a mobile-phone collectible modal that is not implemented in the provided code.",
    "useGameLoop depends on the callbacks object identity; passing a new object literal can restart the RAF effect on re-renders (potential jitter/perf overhead).",
    "useKeyboardControls takes a canvasRef parameter but does not use it (leftover API surface).",
    "PDF generation depends on loading pdf-lib from a public CDN; downloads can fail offline, under strict CSPs, or if the CDN is unavailable.",
    "Wall of Fame query is configured to always refetch on mount with staleTime: 0, which may increase backend traffic during frequent navigation/mount cycles."
  ],
  "isFixRequest": true,
  "gameProjectType": "2d",
  "projectName": "Barnabus, The Undeterred",
  "clarification_mode": "instant",
  "clarification_rounds": 0
}